zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/kl2x/pinctrl/MKL25Z128VLK4-pinctrl.h
/*
 * NOTE: Autogenerated file by kinetis_signal2dts.py
 *       for MKL25Z128VLK4/signal_configuration.xml
 *
 * Copyright (c) 2022, NXP
 * SPDX-License-Identifier: Apache-2.0
 */

/*
 * Delta-deduplicated by dedup_pinctrl.py:
 * based on MKL27Z256VLH4-pinctrl.h with this part's differences applied
 * below (55 removed, 0 changed,
 * 67 added). Regenerate with dedup_pinctrl.py;
 * do not edit by hand.
 * target-hash: 882f4ed1150c2137
 */

#ifndef _ZEPHYR_DTS_BINDING_MKL25Z128VLK4_WRAPPER_
#define _ZEPHYR_DTS_BINDING_MKL25Z128VLK4_WRAPPER_

#include "MKL27Z256VLH4-pinctrl.h"

/* Signals not present on this part */
#undef CLKOUT32K_PTE0
#undef CLKOUT_PTC3
#undef FXIO0_D0_PTD0
#undef FXIO0_D1_PTD1
#undef FXIO0_D2_PTD2
#undef FXIO0_D3_PTD3
#undef FXIO0_D4_PTD4
#undef FXIO0_D4_PTE20
#undef FXIO0_D5_PTD5
#undef FXIO0_D5_PTE21
#undef FXIO0_D6_PTD6
#undef FXIO0_D6_PTE22
#undef FXIO0_D7_PTD7
#undef FXIO0_D7_PTE23
#undef I2S0_MCLK_PTC4
#undef I2S0_MCLK_PTC6
#undef I2S0_MCLK_PTC8
#undef I2S0_RXD0_PTC11
#undef I2S0_RXD0_PTC5
#undef I2S0_RX_BCLK_PTC6
#undef I2S0_RX_BCLK_PTC9
#undef I2S0_RX_FS_PTC10
#undef I2S0_RX_FS_PTC7
#undef I2S0_TXD0_PTA12
#undef I2S0_TXD0_PTC0
#undef I2S0_TXD0_PTC1
#undef I2S0_TX_BCLK_PTA5
#undef I2S0_TX_BCLK_PTB18
#undef I2S0_TX_BCLK_PTC3
#undef I2S0_TX_FS_PTA13
#undef I2S0_TX_FS_PTB19
#undef I2S0_TX_FS_PTC2
#undef LPTMR0_ALT1_PTE30
#undef LPUART0_RX_PTA1
#undef LPUART0_RX_PTB16
#undef LPUART0_RX_PTD6
#undef LPUART0_RX_PTE21
#undef LPUART0_TX_PTA2
#undef LPUART0_TX_PTB17
#undef LPUART0_TX_PTD7
#undef LPUART0_TX_PTE20
#undef LPUART1_RX_PTA18
#undef LPUART1_RX_PTC3
#undef LPUART1_RX_PTE1
#undef LPUART1_TX_PTA19
#undef LPUART1_TX_PTC4
#undef LPUART1_TX_PTE0
#undef LPUART1_TX_PTE30
#undef SPI0_SS_PTC4
#undef SPI0_SS_PTD0
#undef SPI1_MISO_PTE0
#undef SPI1_SCK_PTC3
#undef SPI1_SS_PTD4
#undef USB_SOF_OUT_PTC0
#undef USB_SOF_OUT_PTC7

/* Signals specific to this part */
#define CLKOUTa_PTC3 KINETIS_MUX('C',3,5)
#define EXTRG_IN_PTB8 KINETIS_MUX('B',8,3)
#define PTA14 KINETIS_MUX('A',14,1)
#define PTA15 KINETIS_MUX('A',15,1)
#define PTA16 KINETIS_MUX('A',16,1)
#define PTA17 KINETIS_MUX('A',17,1)
#define PTB10 KINETIS_MUX('B',10,1)
#define PTB11 KINETIS_MUX('B',11,1)
#define PTB8 KINETIS_MUX('B',8,1)
#define PTB9 KINETIS_MUX('B',9,1)
#define PTC12 KINETIS_MUX('C',12,1)
#define PTC13 KINETIS_MUX('C',13,1)
#define PTC16 KINETIS_MUX('C',16,1)
#define PTC17 KINETIS_MUX('C',17,1)
#define PTE2 KINETIS_MUX('E',2,1)
#define PTE3 KINETIS_MUX('E',3,1)
#define PTE4 KINETIS_MUX('E',4,1)
#define PTE5 KINETIS_MUX('E',5,1)
#define SPI0_MISO_PTA16 KINETIS_MUX('A',16,5)
#define SPI0_MISO_PTA17 KINETIS_MUX('A',17,2)
#define SPI0_MOSI_PTA16 KINETIS_MUX('A',16,2)
#define SPI0_MOSI_PTA17 KINETIS_MUX('A',17,5)
#define SPI0_PCS0_PTA14 KINETIS_MUX('A',14,2)
#define SPI0_PCS0_PTC4 KINETIS_MUX('C',4,2)
#define SPI0_PCS0_PTD0 KINETIS_MUX('D',0,2)
#define SPI0_SCK_PTA15 KINETIS_MUX('A',15,2)
#define SPI1_MISO_PTE3 KINETIS_MUX('E',3,2)
#define SPI1_MOSI_PTE3 KINETIS_MUX('E',3,5)
#define SPI1_PCS0_PTB10 KINETIS_MUX('B',10,2)
#define SPI1_PCS0_PTD4 KINETIS_MUX('D',4,2)
#define SPI1_PCS0_PTE4 KINETIS_MUX('E',4,2)
#define SPI1_SCK_PTB11 KINETIS_MUX('B',11,2)
#define SPI1_SCK_PTE2 KINETIS_MUX('E',2,2)
#define TPM_CLKIN0_PTC12 KINETIS_MUX('C',12,4)
#define TPM_CLKIN1_PTC13 KINETIS_MUX('C',13,4)
#define TSI0_CH0_PTB0 KINETIS_MUX('B',0,0)
#define TSI0_CH10_PTB17 KINETIS_MUX('B',17,0)
#define TSI0_CH11_PTB18 KINETIS_MUX('B',18,0)
#define TSI0_CH12_PTB19 KINETIS_MUX('B',19,0)
#define TSI0_CH13_PTC0 KINETIS_MUX('C',0,0)
#define TSI0_CH14_PTC1 KINETIS_MUX('C',1,0)
#define TSI0_CH15_PTC2 KINETIS_MUX('C',2,0)
#define TSI0_CH1_PTA0 KINETIS_MUX('A',0,0)
#define TSI0_CH2_PTA1 KINETIS_MUX('A',1,0)
#define TSI0_CH3_PTA2 KINETIS_MUX('A',2,0)
#define TSI0_CH4_PTA3 KINETIS_MUX('A',3,0)
#define TSI0_CH5_PTA4 KINETIS_MUX('A',4,0)
#define TSI0_CH6_PTB1 KINETIS_MUX('B',1,0)
#define TSI0_CH7_PTB2 KINETIS_MUX('B',2,0)
#define TSI0_CH8_PTB3 KINETIS_MUX('B',3,0)
#define TSI0_CH9_PTB16 KINETIS_MUX('B',16,0)
#define UART0_RX_PTA1 KINETIS_MUX('A',1,2)
#define UART0_RX_PTA15 KINETIS_MUX('A',15,3)
#define UART0_RX_PTB16 KINETIS_MUX('B',16,3)
#define UART0_RX_PTD6 KINETIS_MUX('D',6,3)
#define UART0_RX_PTE21 KINETIS_MUX('E',21,4)
#define UART0_TX_PTA14 KINETIS_MUX('A',14,3)
#define UART0_TX_PTA2 KINETIS_MUX('A',2,2)
#define UART0_TX_PTB17 KINETIS_MUX('B',17,3)
#define UART0_TX_PTD7 KINETIS_MUX('D',7,3)
#define UART0_TX_PTE20 KINETIS_MUX('E',20,4)
#define UART1_RX_PTA18 KINETIS_MUX('A',18,3)
#define UART1_RX_PTC3 KINETIS_MUX('C',3,3)
#define UART1_RX_PTE1 KINETIS_MUX('E',1,3)
#define UART1_TX_PTA19 KINETIS_MUX('A',19,3)
#define UART1_TX_PTC4 KINETIS_MUX('C',4,3)
#define UART1_TX_PTE0 KINETIS_MUX('E',0,3)

#endif /* _ZEPHYR_DTS_BINDING_MKL25Z128VLK4_WRAPPER_ */
